Repository: ulsdevteam/pkp-betterPassword
Catalog: locale/*/locale.po
Languages: pt_br, tr_tr

# plugins.generic.betterPassword.description
source: Enable additional password requirements within PKP software. Allows for implementation of NIST recommendations.
pt_br: Habilita resiquistos de senhas adicionais no software da PKP. Permite implementações do NIST.
tr_tr: ADS yazılımı içinde ek şifre gereksinimlerini etkinleştirin. Bu eklenti NIST tavsiyelerinin uygulanmasına izin verir.

# plugins.generic.betterPassword.validation.betterPasswordCheckAlpha
source: Your password requires an alphabetic character.
pt_br: Sua senha requer um caractere alfabético.
tr_tr: Parolanız alfabetik bir karakter gerektiriyor.

# plugins.generic.betterPassword.validation.betterPasswordCheckUppercase
source: Your password requires an uppercase character.
pt_br: Sua senha requer um caractere maiúsculo.
tr_tr: Parolanız büyük harfli bir karakter gerektiriyor.

# plugins.generic.betterPassword.validation.betterPasswordCheckLowercase
source: Your password requires an lowercase character.
pt_br: Sua senha requer um caractere minúsculo.
tr_tr: Parolanız küçük harfli bir karakter gerektiriyor.

# plugins.generic.betterPassword.validation.betterPasswordCheckNumber
source: Your password requires an numeric character.
pt_br: Sua senha requer um caractere numérico.
tr_tr: Parolanız sayısal bir karakter gerektiriyor.

# plugins.generic.betterPassword.validation.betterPasswordCheckSpecial
source: Your password requires an non-alphanumeric character.
pt_br: Sua senha requer um caractere não especial.
tr_tr: Parolanız alfasayısal olmayan bir karakter gerektiriyor.

# plugins.generic.betterPassword.validation.betterPasswordCheckBlocklist
source: Your password was found in a blocklist of known bad passwords.
pt_br: Sua senha foi encontrada em uma lista de senhas expostas na internet.
tr_tr: Parolanız, bilinen kötü parolaların engellendiği listede bulundu.

# plugins.generic.betterPassword.validation.betterPasswordLocked
source: Your account has been temporarily locked due to bad password attempts.
pt_br: Sua conta foi bloqueada temporariamente devido a tentativas incorretas de senha.
tr_tr: Riskli şifre denemeleri nedeniyle hesabınız geçici olarak kilitlendi.

# plugins.generic.betterPassword.validation.betterPasswordUnexpectedError
source: Your password could not be changed at this time. Please try again later.
pt_br: Sua senha não pode ser alterada neste momento. Por favor, tente novamente mais tarde.
tr_tr: Şifreniz şu anda değiştirilemedi. Lütfen daha sonra tekrar deneyiniz.

# plugins.generic.betterPassword.validation.betterPasswordPasswordReused
source: You cannot reuse this password, please choose another one.
pt_br: Você não pode reutilizar esta senha, por favor escolha outra.
tr_tr: Bu şifreyi tekrar kullanamazsınız, lütfen başka bir şifre belirleyin.

# plugins.generic.betterPassword.manager.settings
source: Settings
pt_br: Configurações
tr_tr: Ayarlar

# plugins.generic.betterPassword.manager.settings.betterPasswordUploadFail
source: Failed to upload file
pt_br: Falha ao enviar arquivo
tr_tr: Dosya yüklenemedi

# plugins.generic.betterPassword.manager.settings.betterPasswordDeleteFail
source: Failed to delete file
pt_br: Falha ao excluir arquivo
tr_tr: Dosya silinemedi

# plugins.generic.betterPassword.manager.betterPasswordSettings
source: Better Password Settings
pt_br: Configurações Better Password
tr_tr: Daha İyi Şifre Ayarları

# plugins.generic.betterPassword.manager.settings.description
source: <p>With this plugin enabled, user passwords will be checked against additional criteria to ensure better password selection. NIST recommends checking passwords against a blocklist and using temporary account locking after repeated password failures. Complexity requirements including specific types of alphanumeric characters are available but not recommended for UX reasons.</p>
pt_br: <p>Com este plugin ativado, as senhas dos usuários serão verificadas em relação a critérios adicionais para garantir uma melhor seleção de senhas. O NIST recomenda verificar as senhas em uma lista de bloqueio e usar o bloqueio temporário de conta após falhas repetidas de senha. Os requisitos de complexidade, incluindo tipos específicos de caracteres alfanuméricos, estão disponíveis, mas não são recomendados por motivos de UX.</p>
tr_tr: <p>Bu eklenti etkinleştirildiğinde, daha iyi şifre seçimi sağlamak için kullanıcı şifreleri ek kriterlere göre kontrol edilecektir. NIST, şifreleri bir engellenenler listesine göre kontrol etmenizi ve tekrarlanan şifre hatalarından sonra geçici hesap kilitlemeyi kullanmanızı önerir. Belirli alfasayısal karakter türleri de dahil olmak üzere karmaşıklık gereksinimleri mevcuttur ancak UX nedenleriyle önerilmez.</p>

# plugins.generic.betterPassword.manager.settings.betterPasswordCheckTitle
source: Password requirements
pt_br: Requisitos de senha
tr_tr: Parola gereksinimleri

# plugins.generic.betterPassword.manager.settings.betterPasswordBlocklist
source: Upload the blocklist file
pt_br: Faça upload do arquivo de senhas não permitidas
tr_tr: Engellenenler listesi dosyasını yükleyin

# plugins.generic.betterPassword.manager.settings.betterPasswordExistingBlocklist
source: Uploaded Blocklists
pt_br: Listas de bloqueio enviadas
tr_tr: Yüklenen Engellenenler Listesi

# plugins.generic.betterPassword.manager.settings.betterPasswordCheckAlpha
source: Require an alphabetic character.
pt_br: Exigir um caractere alfabético.
tr_tr: Alfabetik karakter gerektirir.

# plugins.generic.betterPassword.manager.settings.betterPasswordCheckUppercase
source: Require an uppercase character.
pt_br: Exigir um caractere maiúsculo.
tr_tr: Büyük harfli bir karakter gerektirir.

# plugins.generic.betterPassword.manager.settings.betterPasswordCheckLowercase
source: Require an lowercase character.
pt_br: Exigir um caractere minúsculo.
tr_tr: Küçük harfli bir karakter gerektirir.

# plugins.generic.betterPassword.manager.settings.betterPasswordCheckNumber
source: Require an numeric character.
pt_br: Exigir um caractere numérico.
tr_tr: Sayısal bir karakter gerektirir.

# plugins.generic.betterPassword.manager.settings.betterPasswordCheckSpecial
source: Require an non-alphanumeric character.
pt_br: Exigir um caractere especial.
tr_tr: Alfasayısal olmayan bir karakter gerektirir.

# plugins.generic.betterPassword.manager.settings.betterPasswordCheckBlacklist
source: Check any user-requested passwords against a blocklist of known bad passwords.
pt_br: Verifique todas as senhas solicitadas pelo usuário na lista de senhas bloqueadas.
tr_tr: Kullanıcı tarafından belirlenen parolaları, bilinen hatalı parolaların engellenenler listesiyle karşılaştırın.

# plugins.generic.betterPassword.manager.settings.betterPasswordLockTitle
source: Temporary account locking
pt_br: Bloqueio temporário de conta
tr_tr: Geçici hesap kilitleme

# plugins.generic.betterPassword.manager.settings.betterPasswordLockTries
source: Number of bad login attempts after which to lock an account.
pt_br: Número de tentativas de login incorretas para bloquear uma conta.
tr_tr: Bir hesabı kilitlemek için yapılan hatalı giriş denemelerinin sayısı.

# plugins.generic.betterPassword.manager.settings.betterPasswordLockExpires
source: Number of seconds before forgetting bad login attempts.
pt_br: Número de segundos para esquecer as tentativas de login incorretas.
tr_tr: Aşırı hatalı giriş denemelerinden sonra bir hesabı kilitlemek için geçen saniye sayısı.

# plugins.generic.betterPassword.manager.settings.betterPasswordLockSeconds
source: Number of seconds to lock an account after excessive bad login attempts.
pt_br: Número de segundos para bloquear uma conta após tentativas incorretas excessivas de login.

# plugins.generic.betterPassword.manager.settings.betterPasswordLockRequired
source: If any temporary account locking setting is entered, all temporary account locking settings are required.
pt_br: Se qualquer configuração temporária de bloqueio de conta for inserida, todas as configurações temporárias de bloqueio de conta serão necessárias.
tr_tr: Herhangi bir geçici hesap kilitleme ayarı girilirse, tüm geçici hesap kilitleme ayarları gereklidir.

source: Number of bad login attempts after which to lock an account must be numeric.
pt_br: O número de tentativas de login incorretas para bloquear uma conta.
tr_tr: Bir hesabı kilitlemek için yapılan hatalı giriş denemelerinin sayısı sayısal olmalıdır.

source: Number of seconds before forgetting bad login attempts must be numeric.
pt_br: O número de segundos para esquecer as tentativas de login incorretas.
tr_tr: Hatalı oturum açma girişimlerinin unutulmadan önceki saniye sayısı sayısal olmalıdır.

source: Number of seconds to lock an account after excessive bad login attempts must be numeric.
pt_br: O número de segundos para bloquear uma conta após tentativas incorretas excessivas de login.
tr_tr: Aşırı hatalı giriş denemelerinden sonra bir hesabı kilitlemek için geçen saniye sayısı sayısal olmalıdır.

# plugins.generic.betterPassword.manager.settings.betterPasswordInvalidationTitle
source: Password invalidation
pt_br: Invalidação de senha
tr_tr: Şifre geçersiz kılma

# plugins.generic.betterPassword.manager.settings.betterPasswordInvalidationDays
source: Number of days a user can stay without updating the password.
pt_br: Número de dias para que as senhas expirem.
tr_tr: Parolaların süresinin dolmasına kadar geçen gün sayısı.

source: Number of days, before the expiration, to start warning the user daily about the password expiration must be numeric.
pt_br: Número de dias, antes da expiração, para começar a avisar o usuário diariamente sobre a expiração da senha.
tr_tr: Kullanıcıyı parolanın süresinin dolmasıyla ilgili günlük olarak uyarmaya başlamak için sona erme tarihinden önceki gün sayısı.

source: Number of last passwords that should be blocked for reuse.
pt_br: Número das últimas senhas que devem ser bloqueadas para reutilização.
tr_tr: Yeniden kullanım için engellenmesi gereken son parola sayısı.

source: Number of days a user can stay without updating the password must be numeric.
pt_br: O número de dias antes que as senhas expirem.
tr_tr: Parolaların süresinin dolmasına kadar geçen gün sayısı sayısal olmalıdır.

source: Number of last passwords that should be blocked for reuse must be numeric.
pt_br: O número das últimas senhas que devem ser bloqueadas para reutilização.
tr_tr: Yeniden kullanım için bloke edilmesi gereken son parola sayısı sayısal olmalıdır.

# plugins.generic.betterPassword.message.yourPasswordWillExpire
source: Your password is going to expire in {$days} day(s).
pt_br: Sua senha vai expirar em {$days} dia(s).
tr_tr: {$days} gün içinde şifrenizin süresi dolacak.

# plugins.generic.betterPassword.actions.deleteBlocklist
source: Delete Existing Blocklist
pt_br: Excluir lista de bloqueio de senhas
tr_tr: Mevcut Engellenenler Listesini Sil

# plugins.generic.betterPassword.actions.deleteBlocklistCheck
source: Are you sure you want to delete?
pt_br: Tem certeza de que deseja excluir?
tr_tr: Silmek istediğinden emin misin?

# plugins.generic.betterPassword.displayName
source: Better Password Plugin
tr_tr: Daha İyi Şifre Eklentisi
